Enums/ДействияПоТоварамВАктеКонтроляКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияПоТоварамВАктеКонтроляКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разблокировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПорчу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьКачество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПриходовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыПроверкиКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РезультатыПроверкиКачестваТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдовлетворяетТребованиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУдовлетворяетТребованиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрушеноВПроцессеИсследований</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияПоТоварамВАктеКонтроляКачества/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыМетода = Новый Структура();
	ПараметрыМетода.Вставить("КонтролируемаяПартия", Параметры.КонтролируемаяПартия);
	ПараметрыМетода.Вставить("Склад", Параметры.Склад);
	ПараметрыМетода.Вставить("Дата", Параметры.Дата);
	Действия = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ПолучитьДанныеВыбора(ПараметрыМетода);
	
	ТекущаяСтрока = Действия.НайтиПоЗначению(Параметры.ТекущаяСтрока);
	Если ТекущаяСтрока <> Неопределено Тогда
		ВыбранноеЗначение = ТекущаяСтрока.Значение;
	Иначе
		ВыбранноеЗначение = Действия[0].Значение;
	КонецЕсли;
	
	ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать);
	Видимость = ТекущееДействие <> Неопределено;
	Элементы.ВыбратьЗначениеРазблокировать.Доступность = Видимость;
	Элементы.ПодсказкаРазблокировать.Доступность = Видимость;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКачествоТоваров") Тогда
		ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьПорчу);
		Видимость = ТекущееДействие <> Неопределено;
		Элементы.ВыбратьЗначениеОформитьПорчу.Доступность = Видимость;
		Элементы.ПодсказкаОформитьПорчу.Доступность = Видимость;
	Иначе
		Элементы.ВыбратьЗначениеОформитьПорчу.Видимость = Ложь;
		Элементы.ПодсказкаОформитьПорчу.Видимость = Ложь;
	КонецЕсли;
	
	ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьВозврат);
	Видимость = ТекущееДействие <> Неопределено;
	Элементы.ВыбратьЗначениеОформитьВозврат.Доступность = Видимость;
	Элементы.ПодсказкаОформитьВозврат.Доступность = Видимость;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров") Тогда
		
		ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьПеремещение);
		Видимость = ТекущееДействие <> Неопределено;
		Элементы.ВыбратьЗначениеОформитьПеремещение.Доступность = Видимость;
		Элементы.ПодсказкаОформитьПеремещение.Доступность = Видимость;
		
	Иначе
		
		Элементы.ВыбратьЗначениеОформитьПеремещение.Видимость = Ложь;
		Элементы.ПодсказкаОформитьПеремещение.Видимость = Ложь;
		
	КонецЕсли;
	
	ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьСписание);
	Видимость = ТекущееДействие <> Неопределено;
	Элементы.ВыбратьЗначениеОформитьСписание.Доступность = Видимость;
	Элементы.ПодсказкаОформитьСписание.Доступность = Видимость;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда
		
		ТекстЗаголовка =
			НСтр("ru = 'Принято решение списать поступивший товар на складе.
				|Уместно выбирать, для некачественных товаров, а также разрушенных образцов.
				|Далее штатно оформляется документ ""Списание недостач товаров"".
				|При не ордерном отражении излишков/недостач в документе необходимо указать контролируемую партию.'");
		
	Иначе
		
		ТекстЗаголовка =
			НСтр("ru = 'Принято решение списать поступивший товар на складе.
				|Уместно выбирать, для некачественных товаров, а также разрушенных образцов.
				|Далее штатно оформляется документ ""Списание недостач товаров"".
				|В документе необходимо указать контролируемую партию.'");
		
	КонецЕсли;
	
	Элементы.ПодсказкаОформитьСписание.Заголовок = ТекстЗаголовка;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКачествоТоваров")
			И ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда
		
		ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ИзменитьКачество);
		Видимость = ТекущееДействие <> Неопределено;
		Элементы.ВыбратьЗначениеИзменитьКачество.Доступность = Видимость;
		Элементы.ПодсказкаИзменитьКачество.Доступность = Видимость;
		
	Иначе
		
		Элементы.ВыбратьЗначениеИзменитьКачество.Видимость = Ложь;
		Элементы.ПодсказкаИзменитьКачество.Видимость = Ложь;
		
	КонецЕсли;
	
	ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ВернутьПоставщику);
	Видимость = ТекущееДействие <> Неопределено;
	Элементы.ВыбратьЗначениеВернутьПоставщику.Доступность = Видимость;
	Элементы.ПодсказкаВернутьПоставщику.Доступность = Видимость;
	
	ТекущееДействие = Действия.НайтиПоЗначению(Перечисления.ДействияПоТоварамВАктеКонтроляКачества.НеПриходовать);
	Видимость = ТекущееДействие <> Неопределено;
	Элементы.ВыбратьЗначениеНеПриходовать.Доступность = Видимость;
	Элементы.ПодсказкаНеПриходовать.Доступность = Видимость;
	
	ЗаполнитьПояснение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбратьЗначениеРазблокироватьПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеНеПриходоватьПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеВернутьПоставщикуПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеИзменитьКачествоПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеОформитьСписаниеПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеОформитьПеремещениеПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеОформитьВозвратПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеОформитьПорчуПриИзменении(Элемент)
	ЗаполнитьПояснениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПояснение()
	
	Пояснение = "";
	Видимость = ВыбранноеЗначение = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать
		И Параметры.РезультатПроверкиКачества = Перечисления.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований;
	
	Элементы.ГруппаПояснение.Видимость = Видимость;
	Если Видимость Тогда
		Пояснение = СтрШаблон(НСтр("ru = 'Выбранное действие ""%1"" не соотносится с результатом проверки качества ""%2"".'"),
			Действия.НайтиПоЗначению(ВыбранноеЗначение).Представление, Параметры.РезультатПроверкиКачества);
	Иначе
		Пояснение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПояснениеНаКлиенте()
	
	Пояснение = "";
	Видимость = ВыбранноеЗначение = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать
		И Параметры.РезультатПроверкиКачества = Перечисления.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований;
	
	Элементы.ГруппаПояснение.Видимость = Видимость;
	Если Видимость Тогда
		Пояснение = СтрШаблон(НСтр("ru = 'Выбранное действие ""%1"" не соотносится с результатом проверки качества ""%2"".'"),
			Действия.НайтиПоЗначению(ВыбранноеЗначение).Представление, Параметры.РезультатПроверкиКачества);
	Иначе
		Пояснение = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
